#NAME: Bhumi Pravin Wadkute 

#COLLAGE: (Gov.Poly.Hingoli)

# ASSIGNMENT :

In [1]:
import pandas as pd

In [2]:
pd

In [3]:
df = pd.read_csv('student_info.csv')

In [4]:
df

,student_id,name,gender,age,grade_level,math_score,reading_score,writing_score,attendance_rate,parent_education,study_hours,internet_access,lunch_type,extra_activities,final_result
0,S1,Student_1,Other,17,10,74,61,90,94.660002,Master's,4.120192,Yes,Free or reduced,Yes,Fail
1,S2,Student_2,Male,17,12,99,70,91,93.173227,Bachelor's,2.886505,No,Free or reduced,No,Pass
2,S3,Student_3,Other,17,9,59,60,99,98.631098,PhD,1.909926,No,Free or reduced,No,Fail
3,S4,Student_4,Other,17,12,70,88,69,96.419620,PhD,1.664740,No,Standard,No,Pass
4,S5,Student_5,Male,15,9,85,77,94,91.332105,PhD,2.330918,Yes,Free or reduced,No,Pass
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,S996,Student_996,Female,15,10,76,75,55,94.127440,Bachelor's,2.212263,Yes,Free or reduced,No,Fail
996,S997,Student_997,Female,17,12,83,68,98,86.911592,Bachelor's,3.552898,No,Free or reduced,Yes,Fail
997,S998,Student_998,Other,16,10,60,77,92,80.139645,PhD,2.400027,No,Free or reduced,No,Pass
998,S999,Student_999,Other,17,9,94,66,97,88.069619,PhD,4.713490,No,Free or reduced,Yes,Pass
999,S1000,Student_1000,Male,17,9,96,92,93,84.695088,PhD,1.262504,No,Free or reduced,Yes,Pass

# TASK 1 : DISPLAY SPECIFIC ROWS AND COLUMNS

In [5]:
df.iloc[0:3][['name','grade_level']]

        name  grade_level
0  Student_1           10
1  Student_2           12
2  Student_3            9

# TASK 2 : COUNT GENDER DISTRIBUTION

In [6]:
df['gender'].value_counts()

gender
Male      355
Female    326
Other     319
Name: count, dtype: int64

# TASK 3 : FIND MISSING DATA

In [7]:
df['grade_level'].isnull().sum()

np.int64(0)

# Task 4: Fill Missing Marks

In [8]:
df['grade_level'].replace('fillna', 9)

0      10
1      12
2       9
3      12
4       9
       ..
995    10
996    12
997    10
998     9
999     9
Name: grade_level, Length: 1000, dtype: int64

# Task 5: Filter and Display High Scorers

In [9]:
score=df.loc[df['math_score']>80,['name','math_score']]

In [10]:
score

             name  math_score
1       Student_2          99
4       Student_5          85
7       Student_8          89
10     Student_11          81
13     Student_14          81
..            ...         ...
992   Student_993          86
993   Student_994          85
996   Student_997          83
998   Student_999          94
999  Student_1000          96

[396 rows x 2 columns]

In [11]:
df['math_score'] > 50

0      True
1      True
2      True
3      True
4      True
       ...
995    True
996    True
997    True
998    True
999    True
Name: math_score, Length: 1000, dtype: bool